# #07: Menghapus (drop) missing values `(NaN)`

## Import Modules

In [7]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [9]:
## DEPRICATED ##
# df = pd.util.testing.makeMissingDataframe().reset_index() 
# df.head()

In [17]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.415977  0.823915 -1.316612       NaN
1      1       NaN -0.314983       NaN  0.106285
2      2  0.193313  0.568654  0.347280       NaN
3      3       NaN  0.248993  0.595663 -0.671505
4      4 -0.686919 -0.837546  1.808125  0.210336

In [15]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.892118 -1.538419  1.278925       NaN
1  1 -1.844301  0.987766 -0.016164  1.206382
2  2 -0.657000 -0.192254 -1.326180  0.090485
3  3 -0.236577 -0.149973  0.422416 -0.256341
4  4 -0.258511 -0.330254       NaN  2.082100

In [21]:
df_backup = df.copy(deep=True)

## Menghapus (drop) setiap kolom yang mengandung missing values

In [19]:
df = df.dropna(axis='columns') 
df.head()

   index
0      0
1      1
2      2
3      3
4      4

## Menghapus (drop) setiap baris yang mengandung missing values

In [14]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
0  0  0.801408 -0.334237 -0.117703  0.726622
1  1 -0.095952 -0.044100  0.727250 -1.398099
2  2  1.147211 -0.381032  0.175120 -1.010591
5  5 -1.043774  1.019084 -1.553800 -1.594621
6  6 -0.842565  0.990421 -1.367146 -2.482889

## Persentase missing values untuk tiap kolom

In [16]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.166667
C    0.066667
D    0.033333
dtype: float64

## Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [18]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z         C         D
0  0 -0.117703  0.726622
1  1  0.727250 -1.398099
2  2  0.175120 -1.010591
3  3 -0.212920  0.260404
4  4 -0.663447 -0.160356